# DTM6_GetDTMOver

## Description
Gets the DTM over (geometrically) a specified object.

```pascal
FUNCTION DTM6_GetDTMOver(hObject : HANDLE): HANDLE;
```

```python
def vs.DTM6_GetDTMOver(hObject):
    return HANDLE
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hObject|HANDLE|A handle of the object under which geometry a Site Model is to be searched.|

## See Also
DTM6_GetDTMObject

## Version
Availability: from Vectorworks 2011

## Category
* SiteModel Interface Library